# Задача 14
# Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
limit = int(input("Введите предел вывода степеней числа 2: "))
powers = 2
while powers <= limit:
    print(powers, end = " ")
    powers *= 2
